<?php
/*------Входные данные------*/
$array_1 = [0,3,4,6,9,9,9,9,9];
$array_2 = [-1,0,1,2,5,8];


////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////Sorting////////////////////////////////////////
/*----------------------------------------------------------------------------*/
/*--------------------------Result - arr("numbers")---------------------------*/
/*----------------------------------------------------------------------------*/
function Sorting($array_1,$array_2){
    $result = [];
    $count = count($array_1)+count($array_2);
    
    for($i=0;$i<$count;$i++){
        //Каждый раз мы берем самый первый элемент массива, так как позже меньший 
        //из двух мы перенесем в result и он удалится из изходного массива
        /////////////////////////////////
        /*-----------------------------*/
        $element_array_1 = $array_1[0];
        $element_array_2 = $array_2[0];
        /*-----------------------------*/
        /////////////////////////////////
        
        
        
        //Если один из массивово опустел, значит продолжать перебор смысла нет
        //и мы просто дописываем в конец result(a) оставшийся массив. т.к.
        //по условию массивы уже отсортированны.
        /////////////////////////////////////////////
        /*-----------------------------------------*/
        if(is_null($element_array_1)){
            $result = array_merge($result, $array_2);
            break;
        }
        if(is_null($element_array_2)){
            $result = array_merge($result, $array_1);
            break;
        }
        /*-----------------------------------------*/
        /////////////////////////////////////////////
        
        
        
        //Тут находится основной if. В массиве могут быть одинаковые подряд идущие элементы, 
        //поэтому не забываем про оператор <=
        ////////////////////////////////////////////
        /*---------------------------------------*/
        if($element_array_1 <= $element_array_2 ){
            array_shift($array_1);
            $result[] = $element_array_1;
        }else{
            array_shift($array_2);
            $result[] = $element_array_2;
        }
        /*---------------------------------------*/
        ////////////////////////////////////////////
    }
return $result;
}

////////////////////////////////////////////////////////////////////////////////
///////////////////////////////Remove duplicates////////////////////////////////
/*----------------------------------------------------------------------------*/
/*--------------------------Result - arr("numbers")---------------------------*/
/*----------------------------------------------------------------------------*/
function Remove_duplicates($array){
        $result = []; 
        $marks = []; //создаем массив, в котором будем отмечать повторяющиеся элементы
        
        foreach($array as $key => $value) {
            //Если в массиве отметок мы не найдем элемент который добыли строкой выше
            //то запишем его в result и отметим его как использованный посредством команды
            //$marks[$value] = 1;
            /////////////////////////////
            /*-------------------------*/
            if(is_null($marks[$value])) {
                $result[] = $value;
                $marks[$value] = 1;
            }
            /*-------------------------*/
            /////////////////////////////
        }
return $result;
}


/*------Вывод------*/
$echo = Sorting($array_1,$array_2);
$echo = Remove_duplicates($echo);
print_r($echo);
?>